[
    {
        "name": "Roshogolla",
        "ingredients": [
            "1 liter Milk",
            "2 tbsp Lemon juice",
            "1 cup Sugar",
            "4 cups Water"
        ],
        "instructions": "\n            1. Boil the milk in a large pot.\n            2. Once the milk comes to a boil, add lemon juice gradually while stirring continuously until the milk curdles and the whey separates.\n            3. Turn off the heat and let it sit for 2-3 minutes.\n            4. Line a strainer or colander with a muslin cloth or cheesecloth. Pour the curdled milk into the strainer to separate the whey.\n            5. Rinse the curdled milk under running water to remove the lemon flavor.\n            6. Gather the edges of the cloth and squeeze out any excess water. Hang the cloth for 30 minutes to remove remaining water.\n            7. In the meantime, prepare the sugar syrup by dissolving sugar in water and boiling it for 5 minutes.\n            8. Once the curdled milk is well-drained, transfer it to a clean surface and knead it for 5-7 minutes until it becomes smooth and soft.\n            9. Divide the dough into small portions and shape them into round balls.\n            10. Drop the balls into the sugar syrup and cover the pot. Cook on medium heat for 10-12 minutes until the balls become light and spongy.\n            11. Remove from heat and let the rasgullas cool down to room temperature.\n            12. Refrigerate and serve the chilled rasgullas for a delightful dessert.\n        ",
        "cuisine": "Bangladeshi"
    },
    {
        "name": "Shorshe Ilish",
        "ingredients": [
            "500g Hilsa fish",
            "4 tbsp Mustard paste",
            "1/2 tsp Turmeric powder",
            "4 Green chilies (slit)",
            "4 tbsp Mustard oil",
            "Salt to taste"
        ],
        "instructions": "\n            1. Marinate the fish with turmeric powder and salt. Set aside for 15 minutes.\n            2. Heat mustard oil in a pan and fry the marinated fish until golden brown on both sides. Remove the fish from the pan and set aside.\n            3. In the same pan, add the green chilies and sauté for a minute.\n            4. Reduce the heat and add the mustard paste. Stir well to mix with the oil and cook for 2-3 minutes.\n            5. Add salt and 1 cup of warm water to the pan. Mix well to make a sauce.\n            6. Gently slide the fried fish into the sauce. Cover the pan and cook on low heat for 5-7 minutes until the fish is cooked and the flavors are infused.\n            7. Serve the Shorshe Ilish with steamed rice for a traditional Bengali delight.\n        ",
        "cuisine": "Bangladeshi"
    },
    {
        "name": "Jerk Chicken",
        "ingredients": [
            "2 lbs Chicken",
            "1/4 cup Soy sauce",
            "2 tbsp Lime juice",
            "2 tbsp Brown sugar",
            "1 tbsp Olive oil",
            "4 cloves Garlic (minced)",
            "2 tsp Ginger (minced)",
            "2 tsp Thyme",
            "2 tsp Allspice",
            "1 tsp Cinnamon",
            "1 tsp Nutmeg",
            "1 tsp Black pepper",
            "1 tsp Salt",
            "2 Scotch bonnet peppers (minced)"
        ],
        "instructions": "\n            1. In a bowl, combine soy sauce, lime juice, brown sugar, olive oil, minced garlic, minced ginger, thyme, allspice, cinnamon, nutmeg, black pepper, salt, and minced Scotch bonnet peppers.\n            2. Place the chicken in a ziplock bag and pour the marinade over it. Seal the bag and refrigerate for at least 2 hours or overnight.\n            3. Preheat the grill to medium-high heat.\n            4. Remove the chicken from the marinade, allowing any excess to drip off.\n            5. Grill the chicken for about 6-8 minutes per side, or until it reaches an internal temperature of 165°F (74°C).\n             6. Remove the chicken from the grill and let it rest for a few minutes.\n            7. Serve the jerk chicken with rice, beans, and a side of grilled vegetables for a flavorful Caribbean meal.\n        ",
        "cuisine": "Caribbean"
    },
    {
        "name": "Pho",
        "ingredients": [
            "8 cups Beef or Chicken broth",
            "250g Rice noodles",
            "300g Beef or Chicken (sliced)",
            "1 Onion (sliced)",
            "2 cloves Garlic (minced)",
            "1 tbsp Ginger (minced)",
            "2 Star anise",
            "2 Cinnamon sticks",
            "4 tbsp Fish sauce",
            "1 Lime (cut into wedges)",
            "Bean sprouts, Basil, Cilantro, Jalapeno (for garnish)"
        ],
        "instructions": "\n            1. In a large pot, add the broth, star anise, cinnamon sticks, onion, garlic, and ginger. Bring to a boil and let it simmer for 30 minutes to infuse the flavors.\n            2. Meanwhile, cook the rice noodles according to the package instructions. Drain and set aside.\n            3. Remove the star anise and cinnamon sticks from the broth. Add the sliced beef or chicken and cook for a few minutes until cooked through.\n            4. Stir in the fish sauce and adjust the seasoning if needed.\n            5. Divide the cooked noodles into serving bowls. Ladle the hot broth with beef or chicken over the noodles.\n            6. Serve the pho with lime wedges, bean sprouts, basil, cilantro, and jalapeno on the side. Let each person customize their bowl with the desired garnishes.\n        ",
        "cuisine": "Vietnamese"
    },
    {
        "name": "Bibimbap",
        "ingredients": [
            "2 cups Cooked rice",
            "200g Beef (sliced)",
            "1 Carrot (julienned)",
            "1 Zucchini (julienned)",
            "1 cup Spinach",
            "4 Eggs",
            "2 tbsp Sesame oil",
            "2 tbsp Soy sauce",
            "1 tbsp Gochujang (Korean chili paste)",
            "2 cloves Garlic (minced)",
            "Salt to taste",
            "Vegetable oil (for frying)"
        ],
        "instructions": "\n            1. Marinate the beef slices with soy sauce, sesame oil, minced garlic, and salt. Set aside for 15 minutes.\n            2. Heat a pan with vegetable oil and sauté the marinated beef until cooked. Set aside.\n            3. In the same pan, add a little more oil and stir-fry the carrots and zucchini until tender-crisp. Season with salt. Set aside.\n            4. Blanch the spinach in boiling water for a minute. Drain and squeeze out the excess water. Season with salt and sesame oil. Set aside.\n            5. Fry the eggs sunny-side up or to your desired doneness.\n            6. In a serving bowl, place the cooked rice at the bottom. Arrange the cooked beef, carrots, zucchini, spinach, and fried eggs on top in separate sections.\n            7. Serve the bibimbap with gochujang on the side. Mix everything together before eating to enjoy the delicious flavors.\n        ",
        "cuisine": "Korean"
    },
    {
        "name": "Sauerbraten",
        "ingredients": [
            "2 lbs Beef roast",
            "2 cups Beef broth",
            "1 cup Red wine",
            "1 Onion (sliced)",
            "2 Carrots (sliced)",
            "2 stalks Celery (sliced)",
            "4 cloves Garlic (minced)",
            "4 Bay leaves",
            "10 Peppercorns",
            "4 tbsp Vegetable oil",
            "2 tbsp Flour",
            "2 tbsp Brown sugar",
            "2 tbsp Red wine vinegar",
            "Salt and pepper to taste"
        ],
        "instructions": "\n            1. In a large bowl, combine red wine, beef broth, sliced onion, carrots, celery, minced garlic, bay leaves, peppercorns, salt, and pepper. Mix well to make the marinade.\n            2. Place the beef roast in a ziplock bag and pour the marinade over it. Seal the bag and refrigerate for at least 2 days, turning the roast occasionally.\n            3. Remove the beef roast from the marinade and pat it dry with paper towels. Reserve the marinade.\n            4. Heat vegetable oil in a large pot or Dutch oven over medium-high heat. Sear the beef roast on all sides until browned.\n            5. Reduce the heat to low. Sprinkle flour and brown sugar over the roast, and cook for a few minutes, stirring continuously.\n            6. Slowly pour the reserved marinade and red wine vinegar into the pot, scraping the bottom to release any browned bits.\n            7. Cover the pot and simmer on low heat for about 3-4 hours until the meat is tender, stirring occasionally.\n            8. Remove the beef roast from the pot and let it rest for a few minutes before slicing.\n            9. Strain the cooking liquid and return it to the pot. Bring the liquid to a boil and simmer for a few minutes until it thickens to a gravy consistency.\n            10. Serve the sliced sauerbraten with the thickened gravy, along with potatoes or dumplings for a traditional German meal.\n        ",
        "cuisine": "German"
    },
    {
        "name": "chicken",
        "ingredients": [
            "garlic",
            " onion",
            " chicken"
        ],
        "instructions": "1 tab oil",
        "cuisine": "bangladeshi"
    }
]